Revit 2026 API

# ScheduleDefinitionRemoveField(Int32) Method

---

Removes a field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveField(
	int index
)
```
```vb
Public Sub RemoveField (
	index As Integer
)
```
```cpp
public:
void RemoveField(
	int index
)
```
```fsharp
member RemoveField :
        index : int -> unit
```

#### Parameters

index Int32
     The index of the field to remove.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | index is not a valid field index in this ScheduleDefinition. |

#### Reference

ScheduleDefinition Class

RemoveField Overload

Autodesk.Revit.DB Namespace